Repository: openstack/magnum-ui
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: ru

source: "Master" has been renamed to "Control Plane" in user facing locations in line with Kubernetes teminology. The Magnum API still uses old terms.
ru: "Master" был переименован в "Управляющий слой" в местах, обращенных к пользователю, в соответствии с терминологией Kubernetes. API Magnum по-прежнему использует старые термины.

source: 'bay' and 'baymodel' are changed to 'cluster' and 'cluster template'.
ru: "bay" и "baymodel" изменены на "кластер" и "шаблон кластера".

source: 2023.1 Series Release Notes
ru: Примечания к выпуску 2023.1

source: 2023.2 Series Release Notes
ru: Примечания к выпуску 2023.2

source: 2024.1 Series Release Notes
ru: Примечания к выпуску 2024.1

source: 2024.2 Series Release Notes
ru: Примечания к выпуску 2024.2

source: 2025.1 Series Release Notes
ru: Примечания к выпуску 2025.1

source: API address
ru: API-адрес

source: Add configuration for specifying ingress controllers and addon software supported / available for use with clusters.
ru: Добавлена конфигурация для указания контроллеров ingress трафика и дополнительного программного обеспечения, поддерживаемого/доступного для использования с кластерами.

source: Add fedora-coreos image support. User can choose an image with property 'os_distro=fedora-coreos' on horizon UI when creating a k8s cluster template.
ru: Добавлена ​​поддержка образа fedora-coreos. Пользователь может выбрать образ со свойством 'os_distro=fedora-coreos' в интерфейсе Horizon при создании шаблона кластера k8s.

source: Add following options to cluster template creation and views.
ru: Добавлены следующие параметры для создания и просмотра шаблонов кластеров.

source: Added API service for Quotas. APIs for CLI, REST API for Ajax and REST service for Angular are added. Also stats and quota information are added into cluster table view.
ru: Добавлен API-сервис для квот. Добавлены API для CLI, REST API для Ajax и REST-сервис для Angular. Также статистика и информация о квотах добавлены в вид таблицы кластера.

source: Added attributes for cluster to show. Following cluster attributes were added.
ru: Добавлены атрибуты для отображения кластера. Добавлены следующие атрибуты кластера.

source: Added flavor_id, master_flavor_id and labels for cluster creation as flavor, master flavor and labels.
ru: Добавлены flavor_id, master_flavor_id и метки для создания кластера в виде шаблона конфигурации, основного шаблона конфигурации и меток.

source: Added some attributes for cluster to show. Keypair, API address and Master Addresses are added into drawer on table view. Docker Volume Size, Stack Faults, Master Flavor ID, Node Flavor ID, COE Version, Container Version, Labels and Status Reason are added into details view.
ru: Добавлены некоторые атрибуты для отображения кластера. Ключевая пара, адрес API и главные адреса добавляются в drawer в табличном виде. Размер диска Docker, ошибки стека, шаблон конфигурации мастера, шаблон конфигурации узла, версия COE, версия контейнера, метки и причина состояния добавляются в детальный вид.

source: Adds REST api and Angular service for rolling upgrade action on cluster.
ru: Добавлены REST API и служба Angular для последовательного обновления кластера.

source: Adds REST endpoints for retrieving configured ingress controllers and addon software.
ru: Добавлены точки доступа REST для получения настроенных контроллеров ingress трафика и дополнительного программного обеспечения.

source: Adds python-heatclient >= 1.18.0 dependency
ru: Добавлена ​​зависимость python-heatclient >= 1.18.0

source: Allow to create cluster template without keypair. Also, allow change or set keypair in cluster creation. Following change in Magnum, also Magnum UI allows this feature.
ru: Разрешено создавать шаблон кластера без ключевой пары. Также разрешено изменять или устанавливать ключевую пару при создании кластера. После изменения в Magnum, Magnum UI также позволяет эту функцию.

source: Also, reconstructed layouts for drawer and details views.
ru: Также реконструированы макеты для просмотра ящиков и деталей.

source: Bug Fixes
ru: Исправления ошибок

source: Bump python-magnumclient lowerconstraint to >= 2.15.0
ru: Увеличена минимальная версия python-magnumclient до >= 2.15.0

source: COE Version
ru: Версия COE

source: Change creation actions to global actions. Cluster Template creation and Cluster creation actions are changed from batchAction to globalAction. This means these actions are callable from other panels.
ru: Действия по созданию изменены на глобальные действия. Создание шаблона кластера и действия по созданию кластера изменены с batchAction на globalAction. Это означает, что эти действия можно вызывать из других панелей.

source: Container Version
ru: Версия контейнера

source: Container panel is removed. According to decision of Magnum that changes service scope, container management functions are removed.
ru: Панель контейнеров удалена. Согласно решению Magnum, меняющее сферу обслуживания, функции управления контейнерами удалены.

source: Current Series Release Notes
ru: Примечания к текущему выпуску

source: Deprecation Notes
ru: Примечания об устаревании

source: Disabled action for rotate certificate, due to Magnum API has not support rotate certificate yet. This action will be enabled in the future.
ru: Отключено действие по ротации сертификата, так как Magnum API пока не поддерживает ротацию сертификата. Это действие будет включено в будущем.

source: Docker Volume Size
ru: Размер тома Docker

source: Filled up empty values with '-' on table view and details view using noValue filters. Also show 'None' for empty objects.
ru: Заполнены пустые значения знаком '-' в табличном представлении и детальном представлении с использованием фильтров noValue. Также для пустых объектов отображается 'None'.

source: Fix an issue where a user was unable to create or update a cluster template on Horizon due to missing hidden option expected by the API.
ru: Исправлена ​​ошибка, из-за которой пользователь не мог создать или обновить шаблон кластера в Horizon из-за отсутствия скрытой опции, ожидаемой API.

source: Fixes issue that there is no way to specify for insecure magnumclient as a result api throws 500 and SSL cert verify errors. 'insecure' and 'ca-cert' options are added for magnumclient.
ru: Исправлена ​​проблема, из-за которой не было возможности указать небезопасный magnumclient, в результате чего API выдавало ошибку 500 и ошибку проверки сертификата SSL. Для magnumclient добавлены параметры "insecure" и "ca-cert".

source: Improve cluster launch workflow form.
ru: Улучшена форма запуска кластера.

source: In details view
ru: Детальный обзор

source: In drawer on table view:
ru: Вид drawer on table:

source: Keypair
ru: Ключевая пара

source: Known Issues
ru: Известные проблемы

source: Labels
ru: Метки

source: Limit cluster update properties
ru: Ограничены параметры обновления кластера

source: Magnum UI Release Notes
ru: Примечания к выпуску Magnum UI

source: Magnum UI keeps on following changes for Horizon's AngularJS-based framework. So we can use recent Horizon's feature. And hundreds of JavaScript tests are added. This ensures quality of Magnum UI.
ru: Magnum UI продолжает следовать изменениям для фреймворка Horizon's AngularJS. Поэтому мы можем использовать последние возможности Horizon. И добавлены сотни тестов JavaScript. Это гарантирует качество Magnum UI.

source: Magnum changes its service scope as Container Infrastructure Management service. Also Magnum-UI change rename service 'container' to 'container-infra', and container management functions removed. Magnum uses terms 'cluster' and 'cluster template' instead of 'bay' and 'baymodel', because the use of new Magnum term of 'bay' has caused confusion with users.
ru: Magnum меняет сферу своей деятельности на службу управления инфраструктурой контейнеров. Также Magnum-UI меняет название службы "контейнер" на "контейнер-инфраструктура", а функции управления контейнерами удаляются. Magnum использует термины "кластер" и "шаблон кластера" вместо "bay" и "baymodel", поскольку использование нового термина Magnum "bay" вызвало путаницу у пользователей.

source: Master Addresses
ru: Адреса мастеров

source: Master Flavor ID
ru: ID шаблона конфигурации мастера

source: New Features
ru: Новые возможности

source: Newton Series Release Notes
ru: Примечания к выпуску Newton

source: Ocata Series Release Notes
ru: Примечания к выпуску Ocata

source: Ocata release summary.
ru: Краткий итог выпуска Ocata.

source: Other Notes
ru: Другие примечания

source: Pike Series Release Notes
ru: Примечания к выпуску Pike

source: Prelude
ru: Предисловие

source: Queens Series Release Notes
ru: Примечания к выпуску Queens

source: REST Api and Angular service for resizing clusters is addedd. Angular view supports resizing number of worker nodes only.
ru: Добавлены REST Api и сервис Angular для изменения размера кластеров. Angular поддерживает изменение размера только количества рабочих узлов.

source: Reasonable name is set to browser title bar.
ru: В заголовке браузера установлено корректное имя.

source: Removed link to Stack. Panel for Stack, i.e. Heat Dashboard, was separated to independent UI Plugin. So we removed link to Stack panel on details view for Cluster. We might restore the link if we can find the installed plugins and paths to link.
ru: Удалена ссылка на Stack. Панель для Stack, т.е. панель Heat, была отделена в независимый плагин пользовательского интерфейса. Поэтому мы удалили ссылку на панель Stack в деталях для кластера. Мы можем восстановить ссылку, если сможем найти установленные плагины и пути для ссылки.

source: Rocky Series Release Notes
ru: Примечания к выпуску Rocky

source: Service is renamed from 'container' to 'container-infra'. Renaming targets are URLs, Angular module name, slugs for panel, etc.
ru: Служба переименована из "container" в "container-infra". Целями переименования являются URL, имя модуля Angular, слаги для панели и т. д.

source: Setting the `floating_ip_enabled` check box in the cluster_template creation form to true by default, so as to match with the default in the backend.
ru: Для флажка `floating_ip_enabled` в форме создания cluster_template установлено значение true по умолчанию, чтобы соответствовать значению по умолчанию в бэкенде.

source: Show health status on cluster list table and show health status and health status reason on the cluster details page.
ru: Состояние отображается в таблице списка кластеров, а состояние работоспособности и причина состояния отображаются на странице деталей о кластере.

source: Stack Faults
ru: Ошибки стека

source: Status Reason
ru: Причина состояния

source: Stein Series Release Notes
ru: Примечания к выпуску Stein

source: Support 'ca-show'. The function of downloading CA from cluster is added.
ru: Поддержка "ca-show". Добавлена ​​функция загрузки CA из кластера.

source: Support 'ca-sign'. The function of signing of certificates to cluster is added.
ru: Поддержка "ca-sign". Добавлена ​​функция подписи сертификатов в кластер.

source: Support credential rotation. This adds "Rotate Credential" action for cluster as item action.
ru: Поддержка ротации учетных данных. Это добавляет действие "Ротация учетных данных" для кластера.

source: Support for Horizon's Angular registry service, generic table and detail view, action service.
ru: Поддержка службы реестра Angular Horizon, общего табличного и детального вида, службы действий.

source: Support python 3.5.
ru: Поддержка python 3.5.

source: Supported Calico as network driver for kubernetes.
ru: Поддержан Calico в качестве сетевого драйвера для kubernetes.

source: Supported api-version for client. Magnum API is using micro versions and to get the correct fuctions support, user or client have to initialize the correct client with parameter 'api_version'. Magnum UI also follow the same way as other OpenStack services to read the version from OPENSTACK_API_VERSIONS of Horizon local_settings.py.
ru: Добавлена ​​поддержка api-version для клиента. Magnum API использует микроверсии, и для получения правильной поддержки функций пользователь или клиент должны инициализировать правильный клиент с параметром 'api_version'. Magnum UI также следует тому же пути, что и другие службы OpenStack, для чтения версии из OPENSTACK_API_VERSIONS Horizon local_settings.py.

source: Switch theme for documentation from oslosphinx to openstackdocstheme.
ru: Изменена тема стиля документации с oslosphinx на openstackdocstheme.

source: Switch to reno for managing release notes.
ru: Переход на reno для управления примечаниями к выпуску.

source: The Cluster Create workflow has been improved to provide better input validation.
ru: Процесс создания кластера был улучшен для обеспечения лучшей проверки вводимых данных.

source: The Create Cluster workflow option `floating_ip_enabled` has been replaced with `master_lb_floating_ip_enabled` label as the former added floating IP's to all nodes, whereas the replacement only adds a floating IP to the K8s API loadbalancer itself. The field `floating_ip_enabled` has not changed behaviour and can still be used via the CLI.
ru: Параметр `floating_ip_enabled` в рабочем процессе создания кластера был заменён на `master_lb_floating_ip_enabled`, поскольку первый добавлял плавающие IP-адреса всем узлам, тогда как новая опция добавляет плавающий IP-адрес только самому loadbalancer API K8s. Поведение поля `floating_ip_enabled` не изменилось, и его по-прежнему можно использовать через интерфейс командной строки.

source: The load-edit directive is used. The CSR field on Sign Certificate dialog use load-edit directive newly added into Horizon.
ru: Теперь используется директива load-edit. Поле CSR в диалоговом окне подписи сертификата использует директиву load-edit, недавно добавленную в Horizon.

source: Train Series Release Notes
ru: Примечания к выпуску Ocata

source: Update actions are added for cluster template and cluster.
ru: Добавлены действия по обновлению для шаблона кластера и кластера.

source: Update actions are added for cluster template and cluster. Also, the form maintainability is proceeded by angular-json-schema.
ru: Добавлены действия по обновлению для шаблона кластера и кластера. Также, поддержка формы осуществляется с помощью angular-json-schema.

source: Upgrade Notes
ru: Примечания к обновлению

source: Use horizon's common "views" module for Angular. This proceeds independence against Django framework for plugins.
ru: Используйте общий модуль "views" от Horizon для Angular. Это обеспечивает независимость от фреймворка Django для плагинов.

source: Use initAction() instead initScope(). initScope() is deprecated from Horizon in Ocata and will be removed in Queens.
ru: Используйте initAction() вместо initScope(). initScope() устарел из Horizon в Ocata и будет удален из Queens.

source: Use only tox for test and remove run_tests.sh that is no longer used.
ru: Для тестирования используйте только tox и удалите run_tests.sh, который больше не используется.

source: Use pbr autodoc feature rather than custom logic.
ru: Используйте функцию pbr autodoc вместо пользовательской логики.

source: Used text-download service on horizon. The text-download service have been ported from Magnum UI to Horizon, so we use it.
ru: Теперь используется сервис текстовой загрузки в Horizon. Текстовая загрузка сервиса была перенесена из Magnum UI в Horizon, поэтому мы используем ее.

source: Ussuri Series Release Notes
ru: Примечания к выпуску Ussuri

source: Victoria Series Release Notes
ru: Примечания к выпуску Victoria

source: Wallaby Series Release Notes
ru: Примечания к выпуску Wallaby

source: We removed the Xstatic packages from requirements, as those are not needed anymore. Horizon includes what it needs.
ru: Мы удалили пакеты Xstatic из требований, так как они больше не нужны. Horizon включает то, что ему нужно.

source: Xena Series Release Notes
ru: Примечания к выпуску Xena

source: Yoga Series Release Notes
ru: Примечания к выпуску Yoga

source: Zed Series Release Notes
ru: Примечания к выпуску Zed

source: [`blueprint add-ca-rotate <https://blueprints.launchpad.net/magnum-ui/+spec/add-ca-rotate>`_] Support rotate certificates. This adds "Rotate Certificate" action for cluster as item action.
ru: [`blueprint add-ca-rotate <https://blueprints.launchpad.net/magnum-ui/+spec/add-ca-rotate>`_] Поддержка ротации сертификатов. Это добавляет действие "Ротировать сертификат" для кластера как действие элемента.

source: [`blueprint add-docker-volume-size-option <https://blueprints.launchpad.net/magnum-ui/+spec/add-docker-volume-size-option>`_] Support docker volume size option in cluster creation.
ru: [`blueprint add-docker-volume-size-option <https://blueprints.launchpad.net/magnum-ui/+spec/add-docker-volume-size-option>`_] Поддержка параметра размера тома docker при создании кластера.

source: [`blueprint add-quotas-panel <https://blueprints.launchpad.net/magnum-ui/+spec/add-quotas-panel>`_] Added quotas panel for admin. This panel has CRUD operations for quotas. For now, admin user can limit only the number of clusters for each project. To enable quotas panel, copy `magnum_ui/enabled/_2370_admin_container_infra_panel_group.py` and `magnum_ui/enabled/_2371_admin_container_infra_quotas_panel.py` into horizon's `enabled` directory.
ru: [`blueprint add-quotas-panel <https://blueprints.launchpad.net/magnum-ui/+spec/add-quotas-panel>`_] Добавлена ​​панель квот для администратора. Эта панель имеет операции CRUD для квот. На данный момент администратор может ограничить только количество кластеров для каждого проекта. Чтобы включить панель квот, скопируйте `magnum_ui/enabled/_2370_admin_container_infra_panel_group.py` и `magnum_ui/enabled/_2371_admin_container_infra_quotas_panel.py` в каталог `enabled` Horizon.

source: [`blueprint add-rollback-option <https://blueprints.launchpad.net/magnum-ui/+spec/add-rollback-option>`_] Support rollback option in cluster update. This adds checkbox into cluster update dialog for rollback on failure in update.
ru: [`blueprint add-rollback-option <https://blueprints.launchpad.net/magnum-ui/+spec/add-rollback-option>`_] Поддержка опции отката при обновлении кластера. Это добавляет флажок в диалог обновления кластера для отката при сбое обновления.

source: [`blueprint stats-list <https://blueprints.launchpad.net/magnum-ui/+spec/stats-list>`_] REST API and Angular service for stats list are added. This allows to implement usage views for cluster and nodes.
ru: [`blueprint stats-list <https://blueprints.launchpad.net/magnum-ui/+spec/stats-list>`_] Добавлены REST API и Angular-сервис для списка статистики. Это позволяет реализовать представления использования для кластера и узлов.

source: [`bug/1570668 <https://bugs.launchpad.net/magnum-ui/+bug/1570668>`_] To be convinient to input netwok settings, this changes input forms for External Network, Fixed Network and Fixed Subnet in Cluster Template create/update dialogs to pulldowns.
ru: [`bug/1570668 <https://bugs.launchpad.net/magnum-ui/+bug/1570668>`_] Для удобства ввода сетевых настроек, формы ввода для внешней сети, фиксированной сети и фиксированной подсети в диалоговых окнах создания/обновления шаблона кластера заменяются раскрывающимися списками.

source: [`bug/1638863 <https://bugs.launchpad.net/magnum-ui/+bug/1638863>`_] Fixed failure updating labels for cluster template.
ru: [`bug/1638863 <https://bugs.launchpad.net/magnum-ui/+bug/1638863>`_] Исправлена ​​ошибка обновления меток для шаблона кластера.

source: [`bug/1638863 <https://bugs.launchpad.net/magnum/+bug/1638863>`_] Magnum has issue for updating labels of cluster template and cluster.
ru: [`bug/1638863 <https://bugs.launchpad.net/magnum/+bug/1638863>`_] У Magnum возникла проблема с обновлением меток шаблона кластера и кластера.

source: [`bug/1694634 <https://bugs.launchpad.net/magnum-ui/+bug/1694634>`_] When selected Cluster Template doesn't have Keypair setting, Keypair doesn't be set properly on Create Cluster dialog. This fixes the issue.
ru: [`bug/1694634 <https://bugs.launchpad.net/magnum-ui/+bug/1694634>`_] Если выбранный шаблон кластера не имеет настройки ключевой пары, ключевая пара не будет установлена ​​правильно в диалоговом окне "Создать кластер". Это устраняет проблему.

source: [`bug/1742599 <https://bugs.launchpad.net/magnum-ui/+bug/1742599>`_] Fixed issue the deleted item is selected again with batch delete. Items recently deleted with batch action had been shown in deletion confirmation dialog when execute the batch delete action again. And this had caused the conflict error due to trying to delete unexisting item.
ru: [`bug/1742599 <https://bugs.launchpad.net/magnum-ui/+bug/1742599>`_] Исправлена ​​проблема, при которой удаленный элемент выбирался снова при удалении batch. Элементы, недавно удаленные с помощью batch действия, отображались в диалоговом окне подтверждения удаления при повторном выполнении действия batch удаления. И это вызывало ошибку конфликта из-за попытки удалить несуществующий элемент.

source: [`bug/1746706 <https://bugs.launchpad.net/magnum-ui/+bug/1746706>`_] Reproduced navigations when refreshing details view. Previously the fix for [`bug/1681627 <https://bugs.launchpad.net/horizon/+bug/1681627>`_] allowed us to reload or directly open Angular-based detail page (ngdetail), but the navigation menu was not reproduced correctly.
ru: [`bug/1746706 <https://bugs.launchpad.net/magnum-ui/+bug/1746706>`_] Теперь воспроизводится навигация при обновлении детального вида. Ранее исправление для [`bug/1681627 <https://bugs.launchpad.net/horizon/+bug/1681627>`_] позволяло нам перезагружать или напрямую открывать страницу сведений на основе Angular (ngdetail), но меню навигации воспроизводилось неправильно.

source: [`bug/1777545 <https://bugs.launchpad.net/magnum-ui/+bug/1777545>`_] Fixed issue the deleted item is selected again with batch delete. Item selections on table view for batch actions does not be cleared after execution of actions. To ensure to clear item selections, `hzTable:clearSelection` event is emitted.
ru: [`bug/1777545 <https://bugs.launchpad.net/magnum-ui/+bug/1777545>`_] Исправлена ​​проблема, при которой удаленный элемент выбирался снова при batch удалении. Выбор элементов в табличном видел для batch действий не очищается после выполнения действий. Чтобы гарантировать очистку выбора элементов, генерируется событие `hzTable:clearSelection`.

source: [`story 2003614 <https://storyboard.openstack.org/#!/story/2003614>`_] Added image filtering for magnum. When open a image selector for cluster creation dialog, many invalid images were shown. If a project has a lot of images, options can be quite long, and cause wrong selection by mistake. Now, images that has "os_distro" property and its value is one of "fedora-atomic", "coreos" and "ubuntu" would be shown.
ru: [`story 2003614 <https://storyboard.openstack.org/#!/story/2003614>`_] Добавлена ​​фильтрация образов для magnum. При открытии селектора образов для диалога создания кластера отображалось много недопустимых образов. Если в проекте много образов, параметры могут быть довольно длинными и по ошибке приводить к неправильному выбору. Теперь будут отображаться образы, имеющие свойство "os_distro" и его значение - одно из "fedora-atomic", "coreos" и "ubuntu".

source: [`story 2003865 <https://storyboard.openstack.org/#!/story/2003865>`_] Added master_flavor_id and flavor_id to show in cluster update dialog.
ru: [`story 2003865 <https://storyboard.openstack.org/#!/story/2003865>`_] Добавлены master_flavor_id и flavor_id для отображения в диалоговом окне обновления кластера.
