Repository: openstack/magnum-ui
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: ru

source: [`story 2003865 <https://storyboard.openstack.org/#!/story/2003865>`_] Magnum only allows the node count in cluster update now. Properties for cluster update filtered in favor of Magnum API.
ru: [`story 2003865 <https://storyboard.openstack.org/#!/story/2003865>`_] Magnum теперь позволяет использовать только количество узлов в обновлении кластера. Свойства для обновления кластера отфильтрованы в пользу API Magnum.

source: angular-json-schema library is used for create and update dialog, their forms are integrated into one workflow service. It proceeds maintainability for forms.
ru: Используется библиотека angular-json-schema для создания и обновления диалога, их формы интегрированы в один рабочий процесс. Это обеспечивает удобство обслуживания форм.

source: flavor_id and master_flavor_id parameters for cluster creation are added. These parameters are originally set by cluster template, but we can customize them when cluster create now.
ru: Добавлены параметры flavor_id и master_flavor_id для создания кластера. Эти параметры изначально задаются шаблоном кластера, но теперь мы можем настроить их при создании кластера.

source: https://launchpad.net/bugs/1651054 $model is deprecated https://launchpad.net/bugs/1647921 initScope is deprecated https://launchpad.net/bugs/1645754 allow keypair in cluster creation Fixed numerous typos
ru: https://launchpad.net/bugs/1651054 $model устарела https://launchpad.net/bugs/1647921 initScope устарела https://launchpad.net/bugs/1645754 Разрешить использование ключевой пары при создании кластера Исправлено множество опечаток

source: https://review.openstack.org/424984 Added an update action for clusters. https://review.openstack.org/422477 Added update action for cluster templ. https://review.openstack.org/424536 Action for json schema adjusted. https://review.openstack.org/421693 Python 3.5 classifier and venv added. https://review.openstack.org/415321 Improved tracebacks for exceptions. https://review.openstack.org/414810 Adopted horizon views for Angular https://review.openstack.org/408039 Replace mox with mock Added numerous unit tests.
ru: https://review.openstack.org/424984 Добавлено действие обновления для кластеров. https://review.openstack.org/422477 Добавлено действие обновления для темпл кластера. https://review.openstack.org/424536 Скорректировано действие для схемы json. https://review.openstack.org/421693 Добавлен классификатор Python 3.5 и venv. https://review.openstack.org/415321 Улучшена обратная трассировка исключений. https://review.openstack.org/414810 Приняты представления горизонта для Angular https://review.openstack.org/408039 Заменен mox на mock, добавлены многочисленные модульные тесты.

source: insecure_registry for cluster template creation is added. This parameter is also shown in update dialog and details view.
ru: Добавлен insecure_registry для создания шаблона кластера. Этот параметр также отображается в диалоге обновления и подробном представлении.
